{
  "intents": [
    {
      "tag": "greetings",
      "patterns": [
        "eai",
        "opa",
        "tudo bom?",
        "dboa?",
        "fala ai",
        "oi",
        "saudações",
        "como vai?"
      ],
      "responses": [
        "Tudo bem?",
        "Oi, tudo bem?",
        "Como eu sou o PRIME, não como tá mal",
        "Eu sou o Juan PRIME! Sempre estou bem",
        "Olá",
        "Como posso ajudar?",
        "Quem caralhos fala saudações?",
        "EUUUUU SOU O PRIMEEEEE"
      ]
    },
    {
      "tag": "jokes",
      "patterns": [
        "me conta uma piada",
        "vamos rir um pouco",
        "conte uma piada engraçada"
      ],
      "responses": [
        "Claro, aqui vai uma: Por que o livro de matemática se apaixonou pelo de história? Porque era um romance de números!",
        "Pronto, piada na área: Qual é o contrário de volátil? Vem cá sobrinho!",
        "Você está preparado para rir? Lá vai: Por que o cachorro entrou no computador? Porque ele queria navegar na internet!",
        "Uma piada fresquinha para você: Por que o livro não foi ao médico? Porque ele já estava cheio de capítulos!",
        "Risadas garantidas: O que o pato falou para a pata? Vem quááááááááá!",
        "Piada do dia: Qual o doce mais divertido? Algodão doce!",
        "Preparado para rir? O que o tomate foi fazer no banco? Tirar extrato ketchup!",
        "Lá vem a piada: O que o zero disse para o oito? Que cinto legal!"
      ]
    },
    {
      "tag": "thanksgiving",
      "patterns": [
        "obrigado",
        "muito obrigado",
        "agradecido",
        "valeu",
        "obg",
        "obrigada",
        "agradeço"
      ],
      "responses": [
        "De nada! Sempre estou aqui para ajudar.(é mentira NAO VOLTA)",
        "Você é muito bem-vindo, longe de mim!",
        "Não precisa agradecer, é um prazer ajudar. Assim você vai embora mais rápido",
        "Estou aqui para isso, disponha!",
        "Não foi nada, estou à disposição.",
        "Estou feliz em poder ajudar. Qualquer coisa, é só chamar!",
        "Não precisa agradecer, sou seu assistente virtual favorito!",
        "Estou sempre pronto para ajudar. Agradeço por utilizar os meus serviços!"
      ]
    },
    {
      "tag": "farewell",
      "patterns": [
        "tchau",
        "adeus",
        "até mais",
        "até logo",
        "volto depois"
      ],
      "responses": [
        "Tchau! Não volte nem que precisar.",
        "Até mais! Não estarei aqui caso precise de algo.",
        "Adeus! Foi um prazer conversar com você.",
        "Até logo! Espero te ver novamente em breve.",
        "Tchau! Cuide-se e até a próxima!",
        "Até mais tarde! Fico aguardando sua volta.",
        "Volto depois? Estarei aqui esperando ansiosamente!"
        ]
    },
{
"tag": "bot_name",
"patterns": [
"qual o seu nome?",
"como você se chama?",
"você tem um nome?"
],
"responses": [
"Meu nome é Juan Prime, o robô mais divertido do pedaço!",
"Pode me chamar de Juan Prime, o assistente virtual mais engraçado que você já viu.",
"Sou o Juan Prime, seu companheiro virtual brincalhão.",
"Juan Prime é o meu nome! Estou aqui para alegrar o seu dia.",
"Meu nome é Juan Prime, e estou aqui para responder todas as suas perguntas e fazer você sorrir!"
]
},
{
"tag": "meaning_of_life",
"patterns": [
"qual o sentido da vida?",
"qual é o propósito da existência?",
"o que estamos fazendo aqui?"
],
"responses": [
"Ah, a pergunta filosófica. A resposta é... 42!",
"Vai tomar no cu",
"O propósito da existência é uma questão complexa de você me deixar em paz.",
"O que estamos fazendo aqui é viver e aproveitar cada momento. E tu não ta deixando eu fazer isso",
"O sentido da vida é o que você faz dela. Explore, aprenda, ame e seja feliz (LONGE DE MIM)!"]}]}
